In [1]:
import pandas as pd

In [2]:
#series is one dimensional array
data=pd.Series([1,2,3,4,5])
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# can change the index value
data=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
# Data Frame : 2 Dimensional Array

data=pd.DataFrame([1,2,3,4,5])
data

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
lst=[[1,2,3],[3,5,6],[8,5,3]]
df=pd.DataFrame(lst)
df

   0  1  2
0  1  2  3
1  3  5  6
2  8  5  3

In [6]:
#Dictionary

dict={'Name':["kamal","Amal","Nimal","Sunimal"],"Marks":[89,45,56,75]}
df=pd.DataFrame(dict)
df

      Name  Marks
0    kamal     89
1     Amal     45
2    Nimal     56
3  Sunimal     75

In [9]:
# How to add 2 data frame

dict_1={"sunil":[89,45,56,75],"Amal":[45,65,56,95]}
dict_2={"kamal":[49,55,66,25],"Nimal":[49,35,86,75]}
df_1=pd.DataFrame(dict_1)
df_2=pd.DataFrame(dict_2)

In [10]:
df_1

   sunil  Amal
0     89    45
1     45    65
2     56    56
3     75    95

In [11]:
df_2

   kamal  Nimal
0     49     49
1     55     35
2     66     86
3     25     75

In [13]:
pd.concat([df_1,df_2]) #axis=0 default

   sunil  Amal  kamal  Nimal
0   89.0  45.0    NaN    NaN
1   45.0  65.0    NaN    NaN
2   56.0  56.0    NaN    NaN
3   75.0  95.0    NaN    NaN
0    NaN   NaN   49.0   49.0
1    NaN   NaN   55.0   35.0
2    NaN   NaN   66.0   86.0
3    NaN   NaN   25.0   75.0

In [14]:
pd.concat([df_1,df_2],axis=1)

   sunil  Amal  kamal  Nimal
0     89    45     49     49
1     45    65     55     35
2     56    56     66     86
3     75    95     25     75